app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 8
---
<h3>Comments</h3>
<% @post.comments.each do |comment| %>