app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "jhkkkjhkj"], ["created_at", Sat, 24 Aug 2013 05:50:27 UTC +00:00], ["title", "hello"], ["updated_at", Sat, 24 Aug 2013 05:50:27 UTC +00:00]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "content" = 'jhkkkjhkjhg a', "updated_at" = '2013-08-24 05:50:54.196868' WHERE "posts"."id" = 1

  def latest
    @posts = Post.order("created_at DESC").first(2)
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 2